import { Analytics } from '@vercel/analytics/react';
 
const poemsOutput = document.querySelector(".poems-output");
const poetsOutput = document.querySelector(".poets-output");
const poemsBtn = document.querySelector(".poems-btn");

poemsBtn.addEventListener("click", randomPoems);

// source from facebook group
// မင်းတင်တဲ့ ကဗျာက မင်းဦးနှောက်ရဲ့ level ပဲ
const arrayOfPoems = [
        {
                poets: "- စောညို့ဝန်း-",

                poems: "အချစ်ရေကမ္ဘာကြီးနှစ်လုံးရှိတဲ့အခါမှ <br>တစ်ယောက်တစ်ကမ္ဘာဆီဝေးကြတာပေါ့"

        },
        {
                poets: "- စောညို့ဝန်း-",

                poems: "ကမ္ဘာကြီးလောက်ချစ်တယ် ပြောပြီးမှကမ္ဘာပတ်လမ်းမာလွဲခဲ့ကြပန်းတွေမဝေခဲ့ပါဘူးအလွမ်းတွေပဲဝေခဲ့ပါတယ်။"

        },
        {
                poets: "-သုခမိန်လှိုင်-",

                poems: "မသေတဲ့ အနုပညာတွေရခဲ့တယ် မပျော်တဲ့ ခေတ်တွေရခဲ့တယ်<br> မကျတဲ့ စိတ်တွေ ရခဲ့တယ်မသောက်တဲ့ အရက်တွေ ပိုမူးတယ်မင်းကို<br> ကိုယ်ချစ်ခဲ့တယ်"

        },
        {
                poets: "-လူအ-",

                poems: "တကယ်တော့ ချစ်ခြင်းမေတ္တာဆိုတာနှစ်ဦးဆိုင်နာမ်ပါကွာ<br>မင်းနဲ့ရော ငါနဲ့ရော မဆိုင်ပါဘူး-။"

},
        {
                poets: "-ဦးဘုန်းဓာတု-",

                poems: "အချစ်မှာ မျက်စိမပါဘူးဘာလို့လည်းဆို<br>အမေဟာ ကျွန်တော့်ကို မျက်နှာ မမြင်ခင်ကတည်းက ချစ်ခဲ့တာ။"

},
        {
                poets: "-ပိုင်စိုးဝေ-",

                poems: "မင်းက ငါ့ကိုဒုတိယတန်းစားထဲမှာ ထားခဲ့ချင်သပေါ့ <br>တကယ်တမ်းကျ ငါကတတိယတန်းစားလူတစ်ယောက်ပါကွာ။"



},
        {
                poets: "-အောင်ချိမ့်-",

                poems: "ငါတို့ ဘယ်ရထားမှာ လွဲခဲ့လဲ <br>တစ်ခါ လွဲရင် နှစ်ပေါင်းဘယ်လောက်ကြာတတ်လဲ "



},
        {
                poets: "-အောင်ချိမ့်-",

                poems: "မမြဲခြင်းတရားတွေကို ဟောထားပါလျှက်<br>သူရဲ့လက်ကလေးတွေကိုဆုပ်ကိုင်ထားချင်မိခဲ့တယ်<br>ဘုရားနဲ့ကျွန်တော်ဟာ နားလည်မှုလွဲသွားတယ်။"
        },
        {
                poets: "-အောင်ချိမ့်-",

                poems: "အဆင်ပြေမယ်ဆိုရင် ခလုတ်မထိ ဆူးမငြိ သေချင်ပါတယ်။"
        },
        {
                poets: "-လူပျော်-",

                poems: "ထာ၀ရအပိုင် အဖြစ်လို့တွေးဘာမှမဆိုင်အချစ်<br> တို့ဝေးကြရတာဘယ်အရာကိုသွား တိုင်တည်ရမလဲ။<br>ဘယ်ဘုရား အသည်းကွဲဖူးသလဲ။"
        },
        {
                poets: "-လူအ-",

                poems: " လူတစ်ယောက်ကိုချစ်ဖို့ဆိုတာလွယ်လား ယောက်ဖ <br> အင်း ---လွယ်တာပေါ့<br> ယောက်ဖရကိုယ့်လည်ပင်းကိုယ်ကြိုးကွင်းစွပ်တာပဲဘာများခက်နေလို့လဲ ။"
        },
        {
                poets: "-ငြိမ်းကို-",

                poems: "မနေရဲလို့ သေရဲခဲ့တာပေါ့ကွယ် ။<br> ဘဝမှာနာကျင်စရာတွေ ထပ်ထပ်များလာလဲတူတူရပ်ခဲ့ဘူးတဲ့<br> အဝါရောင်ဖိနပ်လေးကိုတော့နောက်ဆုံးချိန်ထိ ရှိနေစေချင်တယ်။"
        },
        {
                poets: "-ဂန္ဓမာ-",

                poems: "တခြား သူ လက် ထဲ ရော က် မဲ့ ပန်း တွေ ကို ငါ စို က် ပျိုး ခဲ့ ပါတယ်"
        },
        {
                poets: "-ဘုန်းပြည့်စုံမင်း-",

                poems: "ချ စ် တာ လည်း မင်း အပြ စ် မဟု တ် သလို<br> မချ စ် တာ လဲ မင်း အပြ စ် မဟုတ်ပါ ဘူး <br>မချ စ် ပဲ နဲ့ ချ စ် ဟန် ဆော င် ခဲ့ တာ တော့ မင်း လွ န် တာ ပေါ့ အချ စ် ရယ်။"
        },
        {
                poets: "-ဘုန်းတေဇာ-",

                poems: "ဆေး လိ ပ် တွေ၀ အော င် ရှို က် ရင်း၊<br> အရက် တွေ ဂျိုး ကပ်အောင် သောက်ရင်း၊ <br>မှတ် ဉာ ဏ် ထဲ က မင်း ကို၀အောင် လွ မ်း ခြ င်း။"
        },
        {
                poets: "-ဏေသစ်-",

                poems: "ကျော ခို င်း ထား တဲ့ အခါ အရိ ပ် ဟာ မှ န် ထဲ မှာ <br> ကို ယ့် ဘက် လှ ည့် ငေး နေမလားဆို တဲ့ မလုံ မခြုံ အတွေး လည်း ပါ ကောင်းပါ မယ်<br>ကို ယ် သတိ ရပါ တယ်.."
        },
        {
                poets: "-အောင်သင်း-",

                poems: "သေသူမှာ အသက်ရှူရပ်၍<br>ရှင်သူမှာ အသက်ရှူကြပ်လျက် "
        },
        {
                poets: "-တာရာညို-",

                poems: "အလံဖြူထောင်ထားတာကိုအရှုံးပေးပြီလားဆိုတော့<br>အချစ်ရေ မင်းလွန်တာပေါ့။"
        },
        {
                poets: "-တာရာမင်းဝေ-",

                poems: "ချစ်ရတာခက်လားဟင့်အင်း ချစ်ရတာမခက်ပါဘူး<br>ဒါဆို ဘာက ခက်တာလဲချစ်မြဲ ချစ်နေဖို့က ခက်တာ။"
        },
        {
                poets: "-တာရာမင်းဝေ-",

                poems: "တခါတခါကျတော့လည်းအသိရခက်တဲ့လောကရယ်။<br> အသိရခက်တဲ့ ကိုယ့်ကိုယ်ကိုရယ်အသိရခက်တဲ့ ချစ်ခြင်းတရားရယ်။ <br>အားလုံးကို…မေ့ထားလိုက်ချင်တယ်။ "
        },
        {
                poets: "-တာရာမင်းဝေ-",

                poems: "ကိုယ်ချစ်နေတာကိုလဲသူမသိဘူး။<br>သူသိအောင်လဲ ကိုယ်မကြိုးစားဘူး။<br>သူ့အလိုလိုလဲ မသိဘူး။<br>အင်မတန်မှရိုးရှင်းလှသလိုကြေကွဲဖို့လဲ ကောင်းပါတယ်။"
        },
        {
                poets: "-တာရာမင်းဝေ-",

                poems: "ကျွန်တော်က တစ်ယောက်တည်းနေတတ်ပါသည်။<br>အထီးကျန်သည်ဟု မခံစားရပါ။<br>ဤမျှသည်ပင်လျှင် များလှပါပြီ။စည်ကားလှပါပြီ။"
        },
                {
                poets: "-ဆူးရစ်နွယ်-",

                poems: "မင်းကလွဲရင် အားလုံးကို အကြာကြီးစဉ်းစားရပါတယ်<br>မေ့တတ်တာဟာ ရောဂါဖြစ်ပြီး မေ့မရတာဟာလည်း ရောဂါပါပဲ ။"

        },
        {
                poets: "- လူပျော်-",

                poems: "တခါတလေငါမဟုတ်တဲ့ ရင်ခွင်ထဲမှာ<br> မင်းပျော်တယ်တခါတလေမှာတော့ ငိုတယ်။<br>မင်းပျော်သည်ဖြစ်စေမပျော်သည်ဖြစ်စေ..ငါ့နဲ့ မသက်ဆိုင်ရုံမှတပါး။"

        },
        {
                poets: "-မြေသင်းနံ-",

                poems: "မဝံ့ရဲတဲ့တောင်းဆိုမှုတစ်ခုပါပဲ၊<br>အကိုသာခွင့်ပြုမယ်ဆိုရင်၊<br>အကို့ရဲ့'နေကြာပန်း' လေးဖြစ်ပါရစေ။<br>အကို့အနားမှာအကြာကြီးနေပြီး၊<br>အကို့တစ်ယောက်အတွက်ပဲဖြစ်တည်ပါရစေ။"

        },
        {
                poets: "-အောင်ခင်မြင့်-",

                poems: "ယောင်္ကျားတွေဟာ မငိုဘူးဆိုသူ့ရှေ့က အရက်ခွက်ထဲကို <br>ငါ့အစ်ကို တယောက်ရဲ့ မျက်ရည်တွေ <br>မိုးရွာသလို ပိုးပိုးပေါက်ပေါက် ကျနေတာလည်း ငါမြင်ဖူးခဲ့တာပဲ ။"


},
        {
                poets: "-ဝင်းမြင့်-",

                poems: "ရန်ကုန်က ကျဉ်းပါတယ်ဒါပေမယ့်<br>.ပြန်မဆုံနိုင်တော့ဘူး။"

},
        {
                poets: "-ဝင်းမြင့်-",

                poems: "အချစ်မှာ ငါက တိုက်ပွဲခဏခဏ ကျတဲ့ရန်သူ<br>အချစ်မှာ ငါကဆေးရုံက ဆင်းပြေးတဲ့ လူနာ။<br>ရန်ကုန်ဟာ ကျဥ်းပါတယ်ဒါပေမယ့် မဆုံနိုင်တော့ဘူး။"



},
        {
                poets: "-ဝင်းမြင့်-",

                poems: "မိုးလင်းတော့အရှေ့အရပ်ကလှတယ် <br>မိုးချုပ်တော့အနောက်အရပ်ကလှတယ် <br>မင်းလှတာကျတော့တစ်နေ့လုံးဘယ်အချိန်ငေးငေး ။"

},
        {
                poets: "-ဝင်းမြင့်-",

                poems: "အိမ်ဆိုတာ ပြန်လို့ရတဲ့အရာမှန်း သိလေ ပိုနာကျင်လေ <br>ဒါကြောင့်မို့ မြစ်တွေဟာ သွယ်ဝိုက်စီးဆင်းတာ ဖြစ်မယ် ။"
        },
        {
                poets: "-ဝင်းမြင့်-",

                poems: "ငါ့မှာ နှလုံးလမ်းကြောင်းလည်း ကျွန်းမခံရပါဘူးကွာ<br>ရေတိမ် နစ်ခဲ့တာပါ"
        },
        {
                poets: "-ဝင်းမြင့်-",

                poems: "အချစ်မခံရသူ စာရင်းမှာ<br>ငါဟာ လက်ရွေးစင်။"
        },
        {
                poets: "-ဝင်းမြင့်-",

                poems: " မျက်နှာ<br>စာအုပ်ကို လှန်လိုက်တိုင်းစာမျက်နှာတွေ ရှိတယ်။<br>သူမ မျက်နှာလို့ ထင်မှတ်ပြီးစွဲစွဲလမ်းလမ်း ဖတ်တော့တာပဲ။"
        },
        {
                poets: "-ဝင်းမြင့်-",

                poems: "အသည်းအဆီဖုံးမှာပေါ့။<br>ချစ်တမ်းမုန်းတမ်းကစားအထက်တန်းစား<br>ရေပေါ်ဆီကိုမှ သွားချစ်တာကိုး"
        },
        {
                poets: "-ဝင်းမြင့်-",

                poems: "မင်းထွက်ခွာသွားတဲ့ အရပ်ကိုအဝေးပြေးလို့ ခေါ်ကြပြီး<br>ထားရစ်ခဲ့သမျှတွေကို ..ဆိပ်ကမ်းလို့ ခေါ်တယ်။"

        },
        {
                poets: "-ဝင်းမြင့်-",

                poems: "ကမ္ဘာပေါ်မှာဒေါင်လိုက်ကျလာတဲ့အရာတွေကိုတောင်လို့ ခေါ်ပြီး<br>လဲကျသွားတဲ့အရာကိုတော့မြစ်လို့ ခေါ်တယ်။<br>အချစ်ရယ်လွယ်လွယ် မကြွေပါနဲ့။"
        },
        {
                poets: "-ဝင်းမြင့်-",

                poems: "မင်းမရှိတော့ တံတားပျက်တယ်လမ်းပိတ်တယ် <br>မကောင်းတဲ့ အိပ်မက်တွေလည်းမက်တယ် ။"
        },
        {
                poets: "-ဝင်းမြင့်-",

                poems: "ကိုယ့်ရင်ထဲမိန်းမတစ်ယောက် အလုပ်ရှုပ်နေတုန်းက<br>ကိုယ့်ပေါ့ဆမှုကအဆုတ်နဲ့နှလုံးသားကို မခွဲခြားတတ်ခဲ့ဘူး ။"
        },
        {
                poets: "-ယိုလီယွန်-",

                poems: "ဒီနေ့ ရာသီဉတုက မင်းလိုလိုနှင်းလိုလိုပဲ <br>အေးစက်တာလေးရော ပျောက်ကွယ်သွားတာလေးရော အတူတူ။"
                },
        {
                poets: "-မင်းလူ-",

                poems: "မျက်နှာတောင် မကြည့်ချင်ဘူးတဲ့<br>သြော်..မျက်နှာမြင်ချစ်ခင်မိမှာဆိုးလို့လား။"
        },
        {
                poets: "-ဘုန်းပြည့်စုံမင်း-",

                poems: "ငါ့ရဲ့အကြီးမားဆုံးအမှားတစ်ခုကတော့<br>နာကျင်နေတဲ့ အမျိုးသမီးတွေကို<br>ရင့်ကျက်မယ်လို့ထင်ခဲ့မိတာပဲ ။"
        },



        ];

function randomPoems() {
        let random = Number.parseInt(Math.random() * arrayOfPoems.length + 1);
        poemsOutput.innerHTML = `<p>${arrayOfPoems[random].poems}</p>`;
        poetsOutput.innerHTML = `<p>${arrayOfPoems[random].poets}</p>`;
}
