const poemsOutput = document.querySelector(".poems-output");
const poetsOutput = document.querySelector(".poets-output");
const poemsBtn = document.querySelector(".poems-btn");

poemsBtn.addEventListener("click", randomPoems);

const arrayOfPoems = [
        {
                poets: "- စောညို့ဝန်း-",

                poems: "အချစ်ရေကမ္ဘာကြီးနှစ်လုံးရှိတဲ့အခါမှ <br>တစ်ယောက်တစ်ကမ္ဘာဆီဝေးကြတာပေါ့"

        },
        {
                poets: "- စောညို့ဝန်း-",

                poems: "ကမ္ဘာကြီးလောက်ချစ်တယ် ပြောပြီးမှကမ္ဘာပတ်လမ်းမာလွဲခဲ့ကြပန်းတွေမဝေခဲ့ပါဘူးအလွမ်းတွေပဲဝေခဲ့ပါတယ်။"

        },
        {
                poets: "-သုခမိန်လှိုင်-",

                poems: "မသေတဲ့ အနုပညာတွေရခဲ့တယ် မပျော်တဲ့ ခေတ်တွေရခဲ့တယ်<br> မကျတဲ့ စိတ်တွေ ရခဲ့တယ်မသောက်တဲ့ အရက်တွေ ပိုမူးတယ်မင်းကို<br> ကိုယ်ချစ်ခဲ့တယ်"

        },
        {
                poets: "-လူအ-",

                poems: "တကယ်တော့ ချစ်ခြင်းမေတ္တာဆိုတာနှစ်ဦးဆိုင်နာမ်ပါကွာ<br>မင်းနဲ့ရော ငါနဲ့ရော မဆိုင်ပါဘူး-။"

},
        {
                poets: "-ဦးဘုန်းဓာတု-",

                poems: "အချစ်မှာ မျက်စိမပါဘူးဘာလို့လည်းဆို<br>အမေဟာ ကျွန်တော့်ကို မျက်နှာ မမြင်ခင်ကတည်းက ချစ်ခဲ့တာ။"

},
        {
                poets: "-ပိုင်စိုးဝေ-",

                poems: "မင်းက ငါ့ကိုဒုတိယတန်းစားထဲမှာ ထားခဲ့ချင်သပေါ့ <br>တကယ်တမ်းကျ ငါကတတိယတန်းစားလူတစ်ယောက်ပါကွာ။"



},
        {
                poets: "-အောင်ချိမ့်-",

                poems: "ငါတို့ ဘယ်ရထားမှာ လွဲခဲ့လဲ <br>တစ်ခါ လွဲရင် နှစ်ပေါင်းဘယ်လောက်ကြာတတ်လဲ "



},
        {
                poets: "-အောင်ချိမ့်-",

                poems: "မမြဲခြင်းတရားတွေကို ဟောထားပါလျှက်<br>သူရဲ့လက်ကလေးတွေကိုဆုပ်ကိုင်ထားချင်မိခဲ့တယ်<br>ဘုရားနဲ့ကျွန်တော်ဟာ နားလည်မှုလွဲသွားတယ်။"
        },
        {
                poets: "-အောင်ချိမ့်-",

                poems: "အဆင်ပြေမယ်ဆိုရင် ခလုတ်မထိ ဆူးမငြိ သေချင်ပါတယ်။"
        },
        {
                poets: "-လူပျော်-",

                poems: "ထာ၀ရအပိုင် အဖြစ်လို့တွေးဘာမှမဆိုင်အချစ်<br> တို့ဝေးကြရတာဘယ်အရာကိုသွား တိုင်တည်ရမလဲ။<br>ဘယ်ဘုရား အသည်းကွဲဖူးသလဲ။"
        },
        {
                poets: "-လူအ-",

                poems: " လူတစ်ယောက်ကိုချစ်ဖို့ဆိုတာလွယ်လား ယောက်ဖ <br> အင်း ---လွယ်တာပေါ့<br> ယောက်ဖရကိုယ့်လည်ပင်းကိုယ်ကြိုးကွင်းစွပ်တာပဲဘာများခက်နေလို့လဲ ။"
        },
        {
                poets: "-ငြိမ်းကို-",

                poems: "မနေရဲလို့ သေရဲခဲ့တာပေါ့ကွယ် ။<br> ဘဝမှာနာကျင်စရာတွေ ထပ်ထပ်များလာလဲတူတူရပ်ခဲ့ဘူးတဲ့<br> အဝါရောင်ဖိနပ်လေးကိုတော့နောက်ဆုံးချိန်ထိ ရှိနေစေချင်တယ်။"
        },
        {
                poets: "-ဂန္ဓမာ-",

                poems: "တခြား သူ လက် ထဲ ရော က် မဲ့ ပန်း တွေ ကို ငါ စို က် ပျိုး ခဲ့ ပါတယ်"
        },
        {
                poets: "-ဘုန်းပြည့်စုံမင်း-",

                poems: "ချ စ် တာ လည်း မင်း အပြ စ် မဟု တ် သလို<br> မချ စ် တာ လဲ မင်း အပြ စ် မဟုတ်ပါ ဘူး <br>မချ စ် ပဲ နဲ့ ချ စ် ဟန် ဆော င် ခဲ့ တာ တော့ မင်း လွ န် တာ ပေါ့ အချ စ် ရယ်။"
        },
        {
                poets: "-ဘုန်းတေဇာ-",

                poems: "ဆေး လိ ပ် တွေ၀ အော င် ရှို က် ရင်း၊<br> အရက် တွေ ဂျိုး ကပ်အောင် သောက်ရင်း၊ <br>မှတ် ဉာ ဏ် ထဲ က မင်း ကို၀အောင် လွ မ်း ခြ င်း။"
        },
        {
                poets: "-ဏေသစ်-",

                poems: "ကျော ခို င်း ထား တဲ့ အခါ အရိ ပ် ဟာ မှ န် ထဲ မှာ <br> ကို ယ့် ဘက် လှ ည့် ငေး နေမလားဆို တဲ့ မလုံ မခြုံ အတွေး လည်း ပါ ကောင်းပါ မယ်<br>ကို ယ် သတိ ရပါ တယ်.."
        },
        {
                poets: "-အောင်သင်း-",

                poems: "သေသူမှာ အသက်ရှူရပ်၍<br>ရှင်သူမှာ အသက်ရှူကြပ်လျက် "
        },
        {
                poets: "-တာရာညို-",

                poems: "အလံဖြူထောင်ထားတာကိုအရှုံးပေးပြီလားဆိုတော့<br>အချစ်ရေ မင်းလွန်တာပေါ့။"
        },
        {
                poets: "-တာရာမင်းဝေ-",

                poems: "ချစ်ရတာခက်လားဟင့်အင်း ချစ်ရတာမခက်ပါဘူး<br>ဒါဆို ဘာက ခက်တာလဲချစ်မြဲ ချစ်နေဖို့က ခက်တာ။"
        },
        {
                poets: "-တာရာမင်းဝေ-",

                poems: "တခါတခါကျတော့လည်းအသိရခက်တဲ့လောကရယ်။<br> အသိရခက်တဲ့ ကိုယ့်ကိုယ်ကိုရယ်အသိရခက်တဲ့ ချစ်ခြင်းတရားရယ်။ <br>အားလုံးကို…မေ့ထားလိုက်ချင်တယ်။ "
        },
        {
                poets: "-တာရာမင်းဝေ-",

                poems: "ကိုယ်ချစ်နေတာကိုလဲသူမသိဘူး။<br>သူသိအောင်လဲ ကိုယ်မကြိုးစားဘူး။<br>သူ့အလိုလိုလဲ မသိဘူး။<br>အင်မတန်မှရိုးရှင်းလှသလိုကြေကွဲဖို့လဲ ကောင်းပါတယ်။"
        },
        {
                poets: "-တာရာမင်းဝေ-",

                poems: "ကျွန်တော်က တစ်ယောက်တည်းနေတတ်ပါသည်။<br>အထီးကျန်သည်ဟု မခံစားရပါ။<br>ဤမျှသည်ပင်လျှင် များလှပါပြီ။စည်ကားလှပါပြီ။"
        },


        ];

function randomPoems() {
        let random = Number.parseInt(Math.random() * arrayOfPoems.length + 1);
        poemsOutput.innerHTML = `<p>${arrayOfPoems[random].poems}</p>`;
        poetsOutput.innerHTML = `<p>${arrayOfPoems[random].poets}</p>`;
}